Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []


Описание решения задачи:
1. Задан массив строк с разным количеством символов.
2. Введена переменная "x", которая будет равна длине массива.
3. Введена строка "string result", изначально равная пустому месту (""), чтобы ей присваивать значения, удовлетворяющие условию задачи.
4. Запускаю цикл со счетчиком: int i = 0; i < x; i++, где "int i" - индекс массива.
5. С помощью условия "array[i].Length <= 3" внутри цикла проверяю условие задачи: "...из имеющегося массива строк формируем новый массив из строк, длина которых меньше, либо равна 3 символам...". При выполнении условия выводится нужная строка.

string[] array = {"Hello", "2", "world", ":-)"};
int x = array.Length;
string result = "";
for (int i = 0; i < x; i++)
{
    if (array[i].Length <= 3)
    {
        result = array[i];
        Console.Write(result + " ");
    }
}